In [2]:
import pandas as pd
data = pd.read_csv('../csv/german_credit_data.csv', sep=',')
data['Job'] = data['Job'].replace({
    0: 'unskilled and non-resident', 
    1: 'unskilled and resident', 
    2: 'skilled', 
    3: 'highly skilled'
})

In [3]:
data.shape

(1000, 10)

In [4]:
from funpymodeling import status
status(data)

           variable  q_nan  p_nan  q_zeros  p_zeros  unique    type
0               Age      0  0.000        0      0.0      53   int64
1               Sex      0  0.000        0      0.0       2  object
2               Job      0  0.000        0      0.0       4  object
3           Housing      0  0.000        0      0.0       3  object
4   Saving_accounts    183  0.183        0      0.0       4  object
5  Checking_account    394  0.394        0      0.0       3  object
6     Credit_amount      0  0.000        0      0.0     921   int64
7          Duration      0  0.000        0      0.0      33   int64
8           Purpose      0  0.000        0      0.0       8  object
9              Risk      0  0.000        0      0.0       2  object

In [5]:
data['Saving_accounts'].unique()

array([nan, 'little', 'quite rich', 'rich', 'moderate'], dtype=object)

In [6]:
data['Saving_accounts']=data['Saving_accounts'].fillna('other')
data['Saving_accounts'].unique()

array(['other', 'little', 'quite rich', 'rich', 'moderate'], dtype=object)

In [7]:
data['Checking_account'].unique()

array(['little', 'moderate', nan, 'rich'], dtype=object)

In [8]:
data['Checking_account']=data['Checking_account'].fillna('other')
data['Checking_account'].unique()

array(['little', 'moderate', 'other', 'rich'], dtype=object)

In [9]:
status(data)

           variable  q_nan  p_nan  q_zeros  p_zeros  unique    type
0               Age      0    0.0        0      0.0      53   int64
1               Sex      0    0.0        0      0.0       2  object
2               Job      0    0.0        0      0.0       4  object
3           Housing      0    0.0        0      0.0       3  object
4   Saving_accounts      0    0.0        0      0.0       5  object
5  Checking_account      0    0.0        0      0.0       4  object
6     Credit_amount      0    0.0        0      0.0     921   int64
7          Duration      0    0.0        0      0.0      33   int64
8           Purpose      0    0.0        0      0.0       8  object
9              Risk      0    0.0        0      0.0       2  object

In [10]:
data.head()

,Age,Sex,Job,Housing,Saving_accounts,Checking_account,Credit_amount,Duration,Purpose,Risk
0,67,male,skilled,own,other,little,1169,6,radio/TV,good
1,22,female,skilled,own,little,moderate,5951,48,radio/TV,bad
2,49,male,unskilled and resident,own,little,other,2096,12,education,good
3,45,male,skilled,free,little,little,7882,42,furniture/equipment,good
4,53,male,skilled,free,little,little,4870,24,car,bad

In [13]:
data.to_csv('germanbankcredit.csv')